testCases/counterflowDiffusion_fgmFluid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.00  0.000  0.0000)
    (0.02  0.000  0.0000)
    (0.02  0.005  0.0000)
    (0.00  0.005  0.0000)
    (0.00  0.000  0.0001)
    (0.02  0.000  0.0001)
    (0.02  0.005  0.0001)
    (0.00  0.005  0.0001)


);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    upperWall
    {
        type symmetry;
        faces
        (
            (7 6 2 3)
            
        );
    }
    lowerWall
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
            
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1) 
            (4 5 6 7)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
