testCases/counterflowDiffusion_fgmFluid/Allrun
#!/bin/sh
cd "${0%/*}" || exit 1
. "${WM_PROJECT_DIR:?source OpenFOAM bashrc first}/bin/tools/RunFunctions"
[ -d 0 ] || cp -r 0.orig 0
runApplication blockMesh
runApplication setFields
runApplication foamRun
